Tekla Open API Reference for Tekla Structures 2025
Operation.IFCExportFlags.UseIfcMapConversion Property
 Boolean indicating whether to use IfcMapConversion with base points is enabled. By default IFC4 export should use IfcMapConversion. Uninitialized null will be converted to true during export.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool? UseIfcMapConversion {
	get;
 set; }
Public Property UseIfcMapConversion As Boolean?
		Get
	Set
Property Value
Type: Nullable<Boolean>
See Also
Reference
Operation.IFCExportFlags Structure
Tekla.Structures.Model.Operations Namespace